package main

import (
	"fmt"
	"math"
)

// Дана последовательность температурных
// колебаний: -25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
// Объединить данные значения в группы с шагом в 10 градусов.
// Последовательность в подмножноствах не важна.

// Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

func Ex10() {
	fmt.Println("\n=======================================")
	fmt.Println("                  Ex10")
	fmt.Println("---------------------------------------")

	data := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}

	grouped_data := make(map[float64][]float64)

	for _, val := range data {
		group_id := math.Trunc(val/10) * 10
		grouped_data[group_id] = append(grouped_data[group_id], val)

	}

	fmt.Println(grouped_data)

	fmt.Println("=======================================\n")
}
